butok/FNET/fnet_demos/common/startup/startup_mk70fn1/headers/MK20F12.h
/* SKVR Bit Fields */
#define DRY_SKVR_SKV_MASK                        0xFFu
#define DRY_SKVR_SKV_SHIFT                       0
#define DRY_SKVR_SKV(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_SKVR_SKV_SHIFT))&DRY_SKVR_SKV_MASK)
/* SKWLR Bit Fields */
#define DRY_SKWLR_SKWL_MASK                      0xFFu
#define DRY_SKWLR_SKWL_SHIFT                     0
#define DRY_SKWLR_SKWL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKWLR_SKWL_SHIFT))&DRY_SKWLR_SKWL_MASK)
/* SKRLR Bit Fields */
#define DRY_SKRLR_SKRL_MASK                      0xFFu
#define DRY_SKRLR_SKRL_SHIFT                     0
#define DRY_SKRLR_SKRL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKRLR_SKRL_SHIFT))&DRY_SKRLR_SKRL_MASK)
/* CR Bit Fields */
#define DRY_CR_SWR_MASK                          0x1u
#define DRY_CR_SWR_SHIFT                         0
#define DRY_CR_DEN_MASK                          0x2u
#define DRY_CR_DEN_SHIFT                         1
#define DRY_CR_TFSR_MASK                         0x4u
#define DRY_CR_TFSR_SHIFT                        2
#define DRY_CR_UM_MASK                           0x8u
#define DRY_CR_UM_SHIFT                          3
#define DRY_CR_THYD_MASK                         0x100u
#define DRY_CR_THYD_SHIFT                        8
#define DRY_CR_TPFE_MASK                         0x200u
#define DRY_CR_TPFE_SHIFT                        9
#define DRY_CR_TDSE_MASK                         0x400u
#define DRY_CR_TDSE_SHIFT                        10
#define DRY_CR_TSRE_MASK                         0x800u
#define DRY_CR_TSRE_SHIFT                        11
#define DRY_CR_DPR_MASK                          0xFFFE0000u
#define DRY_CR_DPR_SHIFT                         17
#define DRY_CR_DPR(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_CR_DPR_SHIFT))&DRY_CR_DPR_MASK)
/* SR Bit Fields */
#define DRY_SR_DTF_MASK                          0x1u
#define DRY_SR_DTF_SHIFT                         0
#define DRY_SR_TAF_MASK                          0x2u
#define DRY_SR_TAF_SHIFT                         1
#define DRY_SR_TOF_MASK                          0x4u
#define DRY_SR_TOF_SHIFT                         2
#define DRY_SR_MOF_MASK                          0x8u
#define DRY_SR_MOF_SHIFT                         3
#define DRY_SR_VTF_MASK                          0x10u
#define DRY_SR_VTF_SHIFT                         4
#define DRY_SR_CTF_MASK                          0x20u
#define DRY_SR_CTF_SHIFT                         5
#define DRY_SR_TTF_MASK                          0x40u
#define DRY_SR_TTF_SHIFT                         6
#define DRY_SR_STF_MASK                          0x80u
#define DRY_SR_STF_SHIFT                         7
#define DRY_SR_FSF_MASK                          0x100u
#define DRY_SR_FSF_SHIFT                         8
#define DRY_SR_TMF_MASK                          0x200u
#define DRY_SR_TMF_SHIFT                         9
#define DRY_SR_TPF_MASK                          0xFF0000u
#define DRY_SR_TPF_SHIFT                         16
#define DRY_SR_TPF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TPF_SHIFT))&DRY_SR_TPF_MASK)
/* LR Bit Fields */
#define DRY_LR_KSL_MASK                          0x1u
#define DRY_LR_KSL_SHIFT                         0
#define DRY_LR_KVL_MASK                          0x2u
#define DRY_LR_KVL_SHIFT                         1
#define DRY_LR_KWL_MASK                          0x4u
#define DRY_LR_KWL_SHIFT                         2
#define DRY_LR_KRL_MASK                          0x8u
#define DRY_LR_KRL_SHIFT                         3
#define DRY_LR_CRL_MASK                          0x10u
#define DRY_LR_CRL_SHIFT                         4
#define DRY_LR_SRL_MASK                          0x20u
#define DRY_LR_SRL_SHIFT                         5
#define DRY_LR_LRL_MASK                          0x40u
#define DRY_LR_LRL_SHIFT                         6
#define DRY_LR_IEL_MASK                          0x80u
#define DRY_LR_IEL_SHIFT                         7
#define DRY_LR_TSL_MASK                          0x100u
#define DRY_LR_TSL_SHIFT                         8
#define DRY_LR_TEL_MASK                          0x200u
#define DRY_LR_TEL_SHIFT                         9
#define DRY_LR_PDL_MASK                          0x400u
#define DRY_LR_PDL_SHIFT                         10
#define DRY_LR_PPL_MASK                          0x800u
#define DRY_LR_PPL_SHIFT                         11
#define DRY_LR_ATL_MASK                          0x3000u
#define DRY_LR_ATL_SHIFT                         12
#define DRY_LR_ATL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_ATL_SHIFT))&DRY_LR_ATL_MASK)
#define DRY_LR_GFL_MASK                          0xFF0000u
#define DRY_LR_GFL_SHIFT                         16
#define DRY_LR_GFL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_GFL_SHIFT))&DRY_LR_GFL_MASK)
/* IER Bit Fields */
#define DRY_IER_DTIE_MASK                        0x1u
#define DRY_IER_DTIE_SHIFT                       0
#define DRY_IER_TOIE_MASK                        0x4u
#define DRY_IER_TOIE_SHIFT                       2
#define DRY_IER_MOIE_MASK                        0x8u
#define DRY_IER_MOIE_SHIFT                       3
#define DRY_IER_VTIE_MASK                        0x10u
#define DRY_IER_VTIE_SHIFT                       4
#define DRY_IER_CTIE_MASK                        0x20u
#define DRY_IER_CTIE_SHIFT                       5
#define DRY_IER_TTIE_MASK                        0x40u
#define DRY_IER_TTIE_SHIFT                       6
#define DRY_IER_STIE_MASK                        0x80u
#define DRY_IER_STIE_SHIFT                       7
#define DRY_IER_FSIE_MASK                        0x100u
#define DRY_IER_FSIE_SHIFT                       8
#define DRY_IER_TMIE_MASK                        0x200u
#define DRY_IER_TMIE_SHIFT                       9
#define DRY_IER_TPIE_MASK                        0xFF0000u
#define DRY_IER_TPIE_SHIFT                       16
#define DRY_IER_TPIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TPIE_SHIFT))&DRY_IER_TPIE_MASK)
/* TSR Bit Fields */
#define DRY_TSR_TTS_MASK                         0xFFFFFFFFu
#define DRY_TSR_TTS_SHIFT                        0
#define DRY_TSR_TTS(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TSR_TTS_SHIFT))&DRY_TSR_TTS_MASK)
/* TER Bit Fields */
#define DRY_TER_TOE_MASK                         0x4u
#define DRY_TER_TOE_SHIFT                        2
#define DRY_TER_MOE_MASK                         0x8u
#define DRY_TER_MOE_SHIFT                        3
#define DRY_TER_VTE_MASK                         0x10u
#define DRY_TER_VTE_SHIFT                        4
#define DRY_TER_CTE_MASK                         0x20u
#define DRY_TER_CTE_SHIFT                        5
#define DRY_TER_TTE_MASK                         0x40u
#define DRY_TER_TTE_SHIFT                        6
#define DRY_TER_STE_MASK                         0x80u
#define DRY_TER_STE_SHIFT                        7
#define DRY_TER_FSE_MASK                         0x100u
#define DRY_TER_FSE_SHIFT                        8
#define DRY_TER_TME_MASK                         0x200u
#define DRY_TER_TME_SHIFT                        9
#define DRY_TER_TPE_MASK                         0xFF0000u
#define DRY_TER_TPE_SHIFT                        16
#define DRY_TER_TPE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TPE_SHIFT))&DRY_TER_TPE_MASK)
/* PDR Bit Fields */
#define DRY_PDR_TPD_MASK                         0xFFu
#define DRY_PDR_TPD_SHIFT                        0
#define DRY_PDR_TPD(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPD_SHIFT))&DRY_PDR_TPD_MASK)
#define DRY_PDR_TPOD_MASK                        0xFF0000u
#define DRY_PDR_TPOD_SHIFT                       16
#define DRY_PDR_TPOD(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPOD_SHIFT))&DRY_PDR_TPOD_MASK)
/* PPR Bit Fields */
#define DRY_PPR_TPP_MASK                         0xFFu
#define DRY_PPR_TPP_SHIFT                        0
#define DRY_PPR_TPP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPP_SHIFT))&DRY_PPR_TPP_MASK)
#define DRY_PPR_TPID_MASK                        0xFF0000u
#define DRY_PPR_TPID_SHIFT                       16
#define DRY_PPR_TPID(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPID_SHIFT))&DRY_PPR_TPID_MASK)
/* ATR Bit Fields */
#define DRY_ATR_ATSR_MASK                        0xFFFFu
#define DRY_ATR_ATSR_SHIFT                       0
#define DRY_ATR_ATSR(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATSR_SHIFT))&DRY_ATR_ATSR_MASK)
#define DRY_ATR_ATP_MASK                         0xFFFF0000u
#define DRY_ATR_ATP_SHIFT                        16
#define DRY_ATR_ATP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATP_SHIFT))&DRY_ATR_ATP_MASK)
/* PGFR Bit Fields */
#define DRY_PGFR_GFW_MASK                        0x3Fu
#define DRY_PGFR_GFW_SHIFT                       0
#define DRY_PGFR_GFW(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_GFW_SHIFT))&DRY_PGFR_GFW_MASK)
#define DRY_PGFR_GFP_MASK                        0x40u
#define DRY_PGFR_GFP_SHIFT                       6
#define DRY_PGFR_GFE_MASK                        0x80u
#define DRY_PGFR_GFE_SHIFT                       7
#define DRY_PGFR_TPEX_MASK                       0x30000u
#define DRY_PGFR_TPEX_SHIFT                      16
#define DRY_PGFR_TPEX(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_TPEX_SHIFT))&DRY_PGFR_TPEX_MASK)
#define DRY_PGFR_TPE_MASK                        0x1000000u
#define DRY_PGFR_TPE_SHIFT                       24
/* WAC Bit Fields */
#define DRY_WAC_SKVW_MASK                        0x2u
#define DRY_WAC_SKVW_SHIFT                       1
#define DRY_WAC_SKWRW_MASK                       0x4u
#define DRY_WAC_SKWRW_SHIFT                      2
#define DRY_WAC_SKRRW_MASK                       0x8u
#define DRY_WAC_SKRRW_SHIFT                      3
#define DRY_WAC_CRW_MASK                         0x10u
#define DRY_WAC_CRW_SHIFT                        4
#define DRY_WAC_SRW_MASK                         0x20u
#define DRY_WAC_SRW_SHIFT                        5
#define DRY_WAC_LRW_MASK                         0x40u
#define DRY_WAC_LRW_SHIFT                        6
#define DRY_WAC_IEW_MASK                         0x80u
#define DRY_WAC_IEW_SHIFT                        7
#define DRY_WAC_TSRW_MASK                        0x100u
#define DRY_WAC_TSRW_SHIFT                       8
#define DRY_WAC_TEW_MASK                         0x200u
#define DRY_WAC_TEW_SHIFT                        9
#define DRY_WAC_PDW_MASK                         0x400u
#define DRY_WAC_PDW_SHIFT                        10
#define DRY_WAC_PPW_MASK                         0x800u
#define DRY_WAC_PPW_SHIFT                        11
#define DRY_WAC_ATW_MASK                         0x3000u
#define DRY_WAC_ATW_SHIFT                        12
#define DRY_WAC_ATW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_ATW_SHIFT))&DRY_WAC_ATW_MASK)
#define DRY_WAC_GFW_MASK                         0xFF0000u
#define DRY_WAC_GFW_SHIFT                        16
#define DRY_WAC_GFW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_GFW_SHIFT))&DRY_WAC_GFW_MASK)
/* RAC Bit Fields */
#define DRY_RAC_SKVR_MASK                        0x2u
#define DRY_RAC_SKVR_SHIFT                       1
#define DRY_RAC_SKWRR_MASK                       0x4u
#define DRY_RAC_SKWRR_SHIFT                      2
#define DRY_RAC_SKRRR_MASK                       0x8u
#define DRY_RAC_SKRRR_SHIFT                      3
#define DRY_RAC_CRR_MASK                         0x10u
#define DRY_RAC_CRR_SHIFT                        4
#define DRY_RAC_SRR_MASK                         0x20u
#define DRY_RAC_SRR_SHIFT                        5
#define DRY_RAC_LRR_MASK                         0x40u
#define DRY_RAC_LRR_SHIFT                        6
#define DRY_RAC_IER_MASK                         0x80u
#define DRY_RAC_IER_SHIFT                        7
#define DRY_RAC_TSRR_MASK                        0x100u
#define DRY_RAC_TSRR_SHIFT                       8
#define DRY_RAC_TER_MASK                         0x200u
#define DRY_RAC_TER_SHIFT                        9
#define DRY_RAC_PDR_MASK                         0x400u
#define DRY_RAC_PDR_SHIFT                        10
#define DRY_RAC_PPR_MASK                         0x800u
#define DRY_RAC_PPR_SHIFT                        11
#define DRY_RAC_ATR_MASK                         0x3000u
#define DRY_RAC_ATR_SHIFT                        12
#define DRY_RAC_ATR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_ATR_SHIFT))&DRY_RAC_ATR_MASK)
#define DRY_RAC_GFR_MASK                         0xFF0000u
#define DRY_RAC_GFR_SHIFT                        16
#define DRY_RAC_GFR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_GFR_SHIFT))&DRY_RAC_GFR_MASK)
/* SKR Bit Fields */
#define DRY_SKR_SK_MASK                          0xFFFFFFFFu
#define DRY_SKR_SK_SHIFT                         0
#define DRY_SKR_SK(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SKR_SK_SHIFT))&DRY_SKR_SK_MASK)
/* SWAC Bit Fields */
#define DRY_SWAC_SKRW_MASK                       0xFFu
#define DRY_SWAC_SKRW_SHIFT                      0
#define DRY_SWAC_SKRW(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SWAC_SKRW_SHIFT))&DRY_SWAC_SKRW_MASK)
/* SRAC Bit Fields */
#define DRY_SRAC_SKRR_MASK                       0xFFu
#define DRY_SRAC_SKRR_SHIFT                      0
#define DRY_SRAC_SKRR(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SRAC_SKRR_SHIFT))&DRY_SRAC_SKRR_MASK)

/**
 * @}
 */ /* end of group DRY_Register_Masks */


/* DRY - Peripheral instance base addresses */
/** Peripheral DRY base pointer */
#define DRY_BASE_PTR                             ((DRY_MemMapPtr)0x40042000u)

/* ----------------------------------------------------------------------------
   -- DRY - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup DRY_Register_Accessor_Macros DRY - Register accessor macros
 * @{
 */


/* DRY - Register instance definitions */
/* DRY */
#define DRY_SKVR                                 DRY_SKVR_REG(DRY_BASE_PTR)
#define DRY_SKWLR                                DRY_SKWLR_REG(DRY_BASE_PTR)
#define DRY_SKRLR                                DRY_SKRLR_REG(DRY_BASE_PTR)
#define DRY_CR                                   DRY_CR_REG(DRY_BASE_PTR)
#define DRY_SR                                   DRY_SR_REG(DRY_BASE_PTR)
#define DRY_LR                                   DRY_LR_REG(DRY_BASE_PTR)
#define DRY_IER                                  DRY_IER_REG(DRY_BASE_PTR)
#define DRY_TSR                                  DRY_TSR_REG(DRY_BASE_PTR)
#define DRY_TER                                  DRY_TER_REG(DRY_BASE_PTR)
#define DRY_PDR                                  DRY_PDR_REG(DRY_BASE_PTR)
#define DRY_PPR                                  DRY_PPR_REG(DRY_BASE_PTR)
#define DRY_ATR0                                 DRY_ATR_REG(DRY_BASE_PTR,0)
#define DRY_ATR1                                 DRY_ATR_REG(DRY_BASE_PTR,1)
#define DRY_PGFR0                                DRY_PGFR_REG(DRY_BASE_PTR,0)
#define DRY_PGFR1                                DRY_PGFR_REG(DRY_BASE_PTR,1)
#define DRY_PGFR2                                DRY_PGFR_REG(DRY_BASE_PTR,2)
#define DRY_PGFR3                                DRY_PGFR_REG(DRY_BASE_PTR,3)
#define DRY_PGFR4                                DRY_PGFR_REG(DRY_BASE_PTR,4)
#define DRY_PGFR5                                DRY_PGFR_REG(DRY_BASE_PTR,5)
#define DRY_PGFR6                                DRY_PGFR_REG(DRY_BASE_PTR,6)
#define DRY_PGFR7                                DRY_PGFR_REG(DRY_BASE_PTR,7)
#define DRY_WAC                                  DRY_WAC_REG(DRY_BASE_PTR)
#define DRY_RAC                                  DRY_RAC_REG(DRY_BASE_PTR)
#define DRY_SKR0                                 DRY_SKR_REG(DRY_BASE_PTR,0)
#define DRY_SKR1                                 DRY_SKR_REG(DRY_BASE_PTR,1)
#define DRY_SKR2                                 DRY_SKR_REG(DRY_BASE_PTR,2)
#define DRY_SKR3                                 DRY_SKR_REG(DRY_BASE_PTR,3)
#define DRY_SKR4                                 DRY_SKR_REG(DRY_BASE_PTR,4)
#define DRY_SKR5                                 DRY_SKR_REG(DRY_BASE_PTR,5)
#define DRY_SKR6                                 DRY_SKR_REG(DRY_BASE_PTR,6)
#define DRY_SKR7                                 DRY_SKR_REG(DRY_BASE_PTR,7)
#define DRY_SWAC                                 DRY_SWAC_REG(DRY_BASE_PTR)
#define DRY_SRAC                                 DRY_SRAC_REG(DRY_BASE_PTR)

