butok/FNET/fnet_demos/common/startup/startup_mk70fn1/headers/MK20F12.h
/* TSI - Register instance definitions */
/* TSI0 */
#define TSI0_GENCS                               TSI_GENCS_REG(TSI0_BASE_PTR)
#define TSI0_SCANC                               TSI_SCANC_REG(TSI0_BASE_PTR)
#define TSI0_PEN                                 TSI_PEN_REG(TSI0_BASE_PTR)
#define TSI0_WUCNTR                              TSI_WUCNTR_REG(TSI0_BASE_PTR)
#define TSI0_CNTR1                               TSI_CNTR1_REG(TSI0_BASE_PTR)
#define TSI0_CNTR3                               TSI_CNTR3_REG(TSI0_BASE_PTR)
#define TSI0_CNTR5                               TSI_CNTR5_REG(TSI0_BASE_PTR)
#define TSI0_CNTR7                               TSI_CNTR7_REG(TSI0_BASE_PTR)
#define TSI0_CNTR9                               TSI_CNTR9_REG(TSI0_BASE_PTR)
#define TSI0_CNTR11                              TSI_CNTR11_REG(TSI0_BASE_PTR)
#define TSI0_CNTR13                              TSI_CNTR13_REG(TSI0_BASE_PTR)
#define TSI0_CNTR15                              TSI_CNTR15_REG(TSI0_BASE_PTR)
#define TSI0_THRESHOLD                           TSI_THRESHOLD_REG(TSI0_BASE_PTR)

/**
 * @}
 */ /* end of group TSI_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group TSI_Peripheral */


/* ----------------------------------------------------------------------------
   -- UART
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Peripheral UART
 * @{
 */

/** UART - Peripheral register structure */
typedef struct UART_MemMap
{
    uint8_t BDH;                                     /**< UART Baud Rate Registers:High, offset: 0x0 */
    uint8_t BDL;                                     /**< UART Baud Rate Registers: Low, offset: 0x1 */
    uint8_t C1;                                      /**< UART Control Register 1, offset: 0x2 */
    uint8_t C2;                                      /**< UART Control Register 2, offset: 0x3 */
    uint8_t S1;                                      /**< UART Status Register 1, offset: 0x4 */
    uint8_t S2;                                      /**< UART Status Register 2, offset: 0x5 */
    uint8_t C3;                                      /**< UART Control Register 3, offset: 0x6 */
    uint8_t D;                                       /**< UART Data Register, offset: 0x7 */
    uint8_t MA1;                                     /**< UART Match Address Registers 1, offset: 0x8 */
    uint8_t MA2;                                     /**< UART Match Address Registers 2, offset: 0x9 */
    uint8_t C4;                                      /**< UART Control Register 4, offset: 0xA */
    uint8_t C5;                                      /**< UART Control Register 5, offset: 0xB */
    uint8_t ED;                                      /**< UART Extended Data Register, offset: 0xC */
    uint8_t MODEM;                                   /**< UART Modem Register, offset: 0xD */
    uint8_t IR;                                      /**< UART Infrared Register, offset: 0xE */
    uint8_t RESERVED_0[1];
    uint8_t PFIFO;                                   /**< UART FIFO Parameters, offset: 0x10 */
    uint8_t CFIFO;                                   /**< UART FIFO Control Register, offset: 0x11 */
    uint8_t SFIFO;                                   /**< UART FIFO Status Register, offset: 0x12 */
    uint8_t TWFIFO;                                  /**< UART FIFO Transmit Watermark, offset: 0x13 */
    uint8_t TCFIFO;                                  /**< UART FIFO Transmit Count, offset: 0x14 */
    uint8_t RWFIFO;                                  /**< UART FIFO Receive Watermark, offset: 0x15 */
    uint8_t RCFIFO;                                  /**< UART FIFO Receive Count, offset: 0x16 */
    uint8_t RESERVED_1[1];
    uint8_t C7816;                                   /**< UART 7816 Control Register, offset: 0x18 */
    uint8_t IE7816;                                  /**< UART 7816 Interrupt Enable Register, offset: 0x19 */
    uint8_t IS7816;                                  /**< UART 7816 Interrupt Status Register, offset: 0x1A */
    union                                            /* offset: 0x1B */
    {
        uint8_t WP7816_T_TYPE0;                          /**< UART 7816 Wait Parameter Register, offset: 0x1B */
        uint8_t WP7816_T_TYPE1;                          /**< UART 7816 Wait Parameter Register, offset: 0x1B */
    };
    uint8_t WN7816;                                  /**< UART 7816 Wait N Register, offset: 0x1C */
    uint8_t WF7816;                                  /**< UART 7816 Wait FD Register, offset: 0x1D */
    uint8_t ET7816;                                  /**< UART 7816 Error Threshold Register, offset: 0x1E */
    uint8_t TL7816;                                  /**< UART 7816 Transmit Length Register, offset: 0x1F */
    uint8_t RESERVED_2[1];
    uint8_t C6;                                      /**< UART CEA709.1-B Control Register 6, offset: 0x21 */
    uint8_t PCTH;                                    /**< UART CEA709.1-B Packet Cycle Time Counter High, offset: 0x22 */
    uint8_t PCTL;                                    /**< UART CEA709.1-B Packet Cycle Time Counter Low, offset: 0x23 */
    uint8_t B1T;                                     /**< UART CEA709.1-B Beta1 Timer, offset: 0x24 */
    uint8_t SDTH;                                    /**< UART CEA709.1-B Secondary Delay Timer High, offset: 0x25 */
    uint8_t SDTL;                                    /**< UART CEA709.1-B Secondary Delay Timer Low, offset: 0x26 */
    uint8_t PRE;                                     /**< UART CEA709.1-B Preamble, offset: 0x27 */
    uint8_t TPL;                                     /**< UART CEA709.1-B Transmit Packet Length, offset: 0x28 */
    uint8_t IE;                                      /**< UART CEA709.1-B Interrupt Enable Register, offset: 0x29 */
    uint8_t WB;                                      /**< UART CEA709.1-B WBASE, offset: 0x2A */
    uint8_t S3;                                      /**< UART CEA709.1-B Status Register, offset: 0x2B */
    uint8_t S4;                                      /**< UART CEA709.1-B Status Register, offset: 0x2C */
    uint8_t RPL;                                     /**< UART CEA709.1-B Received Packet Length, offset: 0x2D */
    uint8_t RPREL;                                   /**< UART CEA709.1-B Received Preamble Length, offset: 0x2E */
    uint8_t CPW;                                     /**< UART CEA709.1-B Collision Pulse Width, offset: 0x2F */
    uint8_t RIDT;                                    /**< UART CEA709.1-B Receive Indeterminate Time, offset: 0x30 */
    uint8_t TIDT;                                    /**< UART CEA709.1-B Transmit Indeterminate Time, offset: 0x31 */
} volatile *UART_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- UART - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Register_Accessor_Macros UART - Register accessor macros
 * @{
 */


/* UART - Register accessors */
#define UART_BDH_REG(base)                       ((base)->BDH)
#define UART_BDL_REG(base)                       ((base)->BDL)
#define UART_C1_REG(base)                        ((base)->C1)
#define UART_C2_REG(base)                        ((base)->C2)
#define UART_S1_REG(base)                        ((base)->S1)
#define UART_S2_REG(base)                        ((base)->S2)
#define UART_C3_REG(base)                        ((base)->C3)
#define UART_D_REG(base)                         ((base)->D)
#define UART_MA1_REG(base)                       ((base)->MA1)
#define UART_MA2_REG(base)                       ((base)->MA2)
#define UART_C4_REG(base)                        ((base)->C4)
#define UART_C5_REG(base)                        ((base)->C5)
#define UART_ED_REG(base)                        ((base)->ED)
#define UART_MODEM_REG(base)                     ((base)->MODEM)
#define UART_IR_REG(base)                        ((base)->IR)
#define UART_PFIFO_REG(base)                     ((base)->PFIFO)
#define UART_CFIFO_REG(base)                     ((base)->CFIFO)
#define UART_SFIFO_REG(base)                     ((base)->SFIFO)
#define UART_TWFIFO_REG(base)                    ((base)->TWFIFO)
#define UART_TCFIFO_REG(base)                    ((base)->TCFIFO)
#define UART_RWFIFO_REG(base)                    ((base)->RWFIFO)
#define UART_RCFIFO_REG(base)                    ((base)->RCFIFO)
#define UART_C7816_REG(base)                     ((base)->C7816)
#define UART_IE7816_REG(base)                    ((base)->IE7816)
#define UART_IS7816_REG(base)                    ((base)->IS7816)
#define UART_WP7816_T_TYPE0_REG(base)            ((base)->WP7816_T_TYPE0)
#define UART_WP7816_T_TYPE1_REG(base)            ((base)->WP7816_T_TYPE1)
#define UART_WN7816_REG(base)                    ((base)->WN7816)
#define UART_WF7816_REG(base)                    ((base)->WF7816)
#define UART_ET7816_REG(base)                    ((base)->ET7816)
#define UART_TL7816_REG(base)                    ((base)->TL7816)
#define UART_C6_REG(base)                        ((base)->C6)
#define UART_PCTH_REG(base)                      ((base)->PCTH)
#define UART_PCTL_REG(base)                      ((base)->PCTL)
#define UART_B1T_REG(base)                       ((base)->B1T)
#define UART_SDTH_REG(base)                      ((base)->SDTH)
#define UART_SDTL_REG(base)                      ((base)->SDTL)
#define UART_PRE_REG(base)                       ((base)->PRE)
#define UART_TPL_REG(base)                       ((base)->TPL)
#define UART_IE_REG(base)                        ((base)->IE)
#define UART_WB_REG(base)                        ((base)->WB)
#define UART_S3_REG(base)                        ((base)->S3)
#define UART_S4_REG(base)                        ((base)->S4)
#define UART_RPL_REG(base)                       ((base)->RPL)
#define UART_RPREL_REG(base)                     ((base)->RPREL)
#define UART_CPW_REG(base)                       ((base)->CPW)
#define UART_RIDT_REG(base)                      ((base)->RIDT)
#define UART_TIDT_REG(base)                      ((base)->TIDT)

/**
 * @}
 */ /* end of group UART_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- UART Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup UART_Register_Masks UART Register Masks
 * @{
 */

